output/sysbench-ext4/sdb1thread10
WARNING: --num-threads is deprecated, use --threads instead
WARNING: --max-time is deprecated, use --time instead
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 10
Initializing random number generator from current time


Extra file open flags: 0
128 files, 160MiB each
20GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Calling fsync() after each write operation.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      101.45
    writes/s:                     67.74
    fsyncs/s:                     67.74

Throughput:
    read, MiB/s:                  1.59
    written, MiB/s:               1.06

General statistics:
    total time:                          60.0535s
    total number of events:              10161

Latency (ms):
         min:                                  0.01
         avg:                                 59.09
         max:                                245.63
         95th percentile:                    161.51
         sum:                             600444.08

Threads fairness:
    events (avg/stddev):           1016.1000/291.52
    execution time (avg/stddev):   60.0444/0.01